Revit 2024 API
DisciplineTypeId.Structural Property
 Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ForgeTypeId Structural { get; }
Visual Basic
Public Shared ReadOnly Property Structural As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Structural {
	ForgeTypeId^ get ();
}
See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace